<div align='center'><font color='blue'>
<h1>Estudo de Caso</h1>
<h2>Análise de Dados Escolares com Pandas</h2></font>
</div>

Neste Estudo de Caso o objetivo é realizar um detalhado processo de análise de dados 
escolares cruzando, comparando e resumindo, diferentes tipos de informações. \
No total serão respondidas 25 perguntas de negócio que vão requerer analisar os dados 
por diferentes perspectivas. O Pandas será a única ferramenta usada. \
Usaremos para este trabalho dados fictícios, mas que poderiam representar dados reais. \
Os dados foram gerados a partir do Realistic Data Generator, no endereço: https://www.mockaroo.com

In [1]:
# Versão do Python
from platform import python_version
print("Versão Python usada nesse Projeto: ", python_version())

Versão Python usada nesse Projeto:  3.9.7

In [2]:
# Imports
import pandas as pd

In [3]:
# Versões dos pacotes usados neste jupyter notebook
%reload_ext watermark
%watermark --iversions

pandas: 1.3.4

### Carregando os dados
- Serão carregados 3 datasets para explorar
- Criação de um novo dataset

Carregando o dataset das escolas

In [4]:
dados_escolas = pd.read_csv('dados/dataset_escolas.csv')

In [5]:
dados_escolas.shape

(15, 5)

In [6]:
# Visualização
dados_escolas.head()

   ID_Escola Nome_Escola Tipo_Escola  Numero_Alunos  Orcamento_Anual
0          0    Escola A     Publica           2917          1910635
1          1    Escola B     Publica           2949          1884411
2          2    Escola C  Particular           1761          1056600
3          3    Escola D     Publica           4635          3022020
4          4    Escola E  Particular           1468           917500

Carregando o dataset dos estudantes de todas as escolas

In [7]:
dados_estudantes = pd.read_csv('dados/dataset_estudantes.csv')

In [8]:
dados_estudantes.shape

(39160, 7)

In [9]:
# Visualização
dados_estudantes.head()

,ID_Estudante,Nome_Estudante,Genero,Serie,Nome_Escola,Nota_Redacao,Nota_Matematica
0,0,Kevin Bradley,M,6,Escola A,66,79
1,1,Paul Smith,M,9,Escola A,94,61
2,2,John Rodriguez,M,9,Escola A,90,60
3,3,Oliver Scott,M,9,Escola A,67,58
4,4,William Ray,F,6,Escola A,97,84

Criação de um novo dataset com a junção do dados_estudantes e dados_escolas

In [10]:
# Criação do dataset com valores dois dois datasets acima
df_full = pd.merge(dados_estudantes, dados_escolas, how = 'left', on = ['Nome_Escola', 'Nome_Escola'])

In [11]:
df_full.shape

(39160, 11)

In [12]:
# Visualização
df_full.head()

,ID_Estudante,Nome_Estudante,Genero,Serie,Nome_Escola,Nota_Redacao,Nota_Matematica,ID_Escola,Tipo_Escola,Numero_Alunos,Orcamento_Anual
0,0,Kevin Bradley,M,6,Escola A,66,79,0,Publica,2917,1910635
1,1,Paul Smith,M,9,Escola A,94,61,0,Publica,2917,1910635
2,2,John Rodriguez,M,9,Escola A,90,60,0,Publica,2917,1910635
3,3,Oliver Scott,M,9,Escola A,67,58,0,Publica,2917,1910635
4,4,William Ray,F,6,Escola A,97,84,0,Publica,2917,1910635

<font color= 'blue'><h3>Análise do Dataset</h3></font>

In [13]:
# Verificando os valores únicos na coluna Serie
df_full['Serie'].unique()

array([6, 9, 8, 7], dtype=int64)

**Temos dados de quantas escolas?**

In [14]:
tot_escolas = len(df_full['Nome_Escola'].unique()) ; tot_escolas

15

**Qual o total de registo de estudantes na base de estudantes?**

In [15]:
tot_estudantes = df_full['ID_Estudante'].count() ; tot_estudantes

39160

**Qual o orçamento total considerando todas as escolas?**

In [16]:
tot_orcamento = dados_escolas['Orcamento_Anual'].sum(); tot_orcamento

24649428

**Qual a média da nota dos alunos em Redação?**

In [17]:
nota_media_red = df_full['Nota_Redacao'].mean() ; nota_media_red

81.87574055158325

**Qual a média de notas dos alunos em Matemática?**

In [18]:
nota_media_mat = df_full['Nota_Matematica'].mean() ; nota_media_mat

78.98493360572012

**Considerando que a nota de aprovação é 70, quantos alunos foram aprovados em Redação?**

In [19]:
aprovados_red = df_full[(df_full['Nota_Redacao'] >= 70)].count()['Nome_Estudante'] ; aprovados_red

33600

**Resultado da célula acima em valor em percentual**

In [20]:
aprovados_red_perc = aprovados_red / float(tot_estudantes) * 100; aprovados_red_perc

85.80183861082737

**Considerando que a nota de aprovação é 70, quantos alunos foram aprovados em Matemática?**

In [21]:
aprovados_mat = df_full[(df_full['Nota_Matematica'] >= 70)].count()['Nome_Estudante'] ; aprovados_mat

29360

**Resultado da célula acima em valor em percentual**

In [22]:
aprovados_mat_perc = aprovados_mat / float(tot_estudantes) * 100; aprovados_mat_perc

74.97446373850867

**Considerando que a nota de aprovação é 70, quantos alunos foram aprovados em Matemática e Redação?**

In [23]:
aprovados_mat_red = df_full[(df_full['Nota_Matematica'] >= 70) & (df_full['Nota_Redacao'] >= 70)].count()['Nome_Estudante']

In [24]:
aprovados_mat_red

25518

**Resultado da célula acima em valor em percentual**

In [25]:
aprovados_mat_red_perc = aprovados_mat_red/ float(tot_estudantes) * 100; aprovados_mat_red_perc

65.16343207354444

**Crie um dataframe com os resultados das questões de 1 a 8 que você calculou acima.**

In [26]:
df_performance_escolar = pd.DataFrame({'Total_Escolas' : [tot_escolas],
                                       'Total_Estudantes' : [tot_estudantes],
                                       'Orcamento_total' : [tot_orcamento],
                                       'Nota_Media_Redacaoo': [nota_media_red], 
                                       'Nota_Média_Matematica': [nota_media_mat],
                                       '% Aprovação Redação': [aprovados_red_perc],
                                       '% Aprovação Matemática': [aprovados_mat_perc],
                                       '% Aprovação Total': [aprovados_mat_red_perc]
})

In [27]:
df_performance_escolar

,Total_Escolas,Total_Estudantes,Orcamento_total,Nota_Media_Redacaoo,Nota_Média_Matematica,% Aprovação Redação,% Aprovação Matemática,% Aprovação Total
0,15,39160,24649428,81.875741,78.984934,85.801839,74.974464,65.163432

In [28]:
type(df_performance_escolar)

pandas.core.frame.DataFrame

**Formate as colunas "Total_Estudantes" e "Orcamento_total" ajustando as casas decimais.**

In [29]:
df_performance_escolar["Total_Estudantes"] = df_performance_escolar["Total_Estudantes"].map("{:,}".format)
df_performance_escolar["Orcamento_total"] = df_performance_escolar["Orcamento_total"].map("{:,.2f}".format)

In [30]:
df_performance_escolar

,Total_Escolas,Total_Estudantes,Orcamento_total,Nota_Media_Redacaoo,Nota_Média_Matematica,% Aprovação Redação,% Aprovação Matemática,% Aprovação Total
0,15,"39,160","24,649,428.00",81.875741,78.984934,85.801839,74.974464,65.163432

In [31]:
df_full

,ID_Estudante,Nome_Estudante,Genero,Serie,Nome_Escola,Nota_Redacao,Nota_Matematica,ID_Escola,Tipo_Escola,Numero_Alunos,Orcamento_Anual
0,0,Kevin Bradley,M,6,Escola A,66,79,0,Publica,2917,1910635
1,1,Paul Smith,M,9,Escola A,94,61,0,Publica,2917,1910635
2,2,John Rodriguez,M,9,Escola A,90,60,0,Publica,2917,1910635
3,3,Oliver Scott,M,9,Escola A,67,58,0,Publica,2917,1910635
4,4,William Ray,F,6,Escola A,97,84,0,Publica,2917,1910635
...,...,...,...,...,...,...,...,...,...,...,...
39155,39155,John Brooks,M,7,Escola O,92,98,14,Particular,1635,1043130
39156,39156,Stephanie Contreras,F,8,Escola O,79,95,14,Particular,1635,1043130
39157,39157,Kristen Gonzalez,F,6,Escola O,79,94,14,Particular,1635,1043130
39158,39158,Kari Holloway,F,7,Escola O,87,90,14,Particular,1635,1043130
39159,39159,Kimberly Cabrera,F,8,Escola O,85,72,14,Particular,1635,1043130

**Entre os alunos aprovados em Redação, qual gênero obteve maior número de aprovações?**

In [32]:
aprovados_genero_red = df_full[(df_full['Nota_Redacao'] >= 70)]['Genero'].value_counts(); aprovados_genero_red

F    17027
M    16573
Name: Genero, dtype: int64

**Entre os alunos aprovados em Matemática, qual gênero obteve maior número de aprovações?**

In [33]:
aprovados_genero_mat = df_full[(df_full['Nota_Matematica'] >= 70)]['Genero'].value_counts(); aprovados_genero_mat

F    14835
M    14525
Name: Genero, dtype: int64

**Quais os tipos de todas as escolas em nossa base de dados?**

In [34]:
dados_escolas

    ID_Escola Nome_Escola Tipo_Escola  Numero_Alunos  Orcamento_Anual
0           0    Escola A     Publica           2917          1910635
1           1    Escola B     Publica           2949          1884411
2           2    Escola C  Particular           1761          1056600
3           3    Escola D     Publica           4635          3022020
4           4    Escola E  Particular           1468           917500
5           5    Escola F  Particular           2283          1319574
6           6    Escola G  Particular           1858          1081356
7           7    Escola H     Publica           4976          3124928
8           8    Escola I  Particular            427           248087
9           9    Escola J  Particular            962           585858
10         10    Escola K  Particular           1800          1049400
11         11    Escola L     Publica           3999          2547363
12         12    Escola M     Publica           4761          3094650
13         13    Escola N     Publica           2739          1763916
14         14    Escola O  Particular           1635          1043130

In [35]:
dados_escolas['Tipo_Escola'].value_counts()

Particular    8
Publica       7
Name: Tipo_Escola, dtype: int64

In [36]:
tipos_escolas = dados_escolas.set_index(['Nome_Escola'])['Tipo_Escola'].sort_values(); tipos_escolas

Nome_Escola
Escola C    Particular
Escola E    Particular
Escola F    Particular
Escola G    Particular
Escola I    Particular
Escola J    Particular
Escola K    Particular
Escola O    Particular
Escola A       Publica
Escola B       Publica
Escola D       Publica
Escola H       Publica
Escola L       Publica
Escola M       Publica
Escola N       Publica
Name: Tipo_Escola, dtype: object

**Qual o total de estudantes por escola?**

In [37]:
tot_estudantes_escolas = df_full['Nome_Escola'].value_counts().sort_values(); tot_estudantes_escolas

Escola I     427
Escola J     962
Escola E    1468
Escola O    1625
Escola C    1761
Escola K    1800
Escola G    1858
Escola F    2283
Escola N    2739
Escola A    2917
Escola B    2949
Escola L    3999
Escola D    4635
Escola M    4761
Escola H    4976
Name: Nome_Escola, dtype: int64

**Qual o total de orçamento de cada escola per capita (por estudante)?**

In [38]:
orcamento_escolas = df_full.groupby(['Nome_Escola']).mean()['Orcamento_Anual'].sort_values(); orcamento_escolas

Nome_Escola
Escola I     248087.0
Escola J     585858.0
Escola E     917500.0
Escola O    1043130.0
Escola K    1049400.0
Escola C    1056600.0
Escola G    1081356.0
Escola F    1319574.0
Escola N    1763916.0
Escola B    1884411.0
Escola A    1910635.0
Escola L    2547363.0
Escola D    3022020.0
Escola M    3094650.0
Escola H    3124928.0
Name: Orcamento_Anual, dtype: float64

In [39]:
tot_orc_per_capita = (orcamento_escolas / tot_estudantes_escolas).sort_values(); tot_orc_per_capita

Escola F    578.000000
Escola I    581.000000
Escola G    582.000000
Escola K    583.000000
Escola C    600.000000
Escola J    609.000000
Escola E    625.000000
Escola H    628.000000
Escola L    637.000000
Escola B    639.000000
Escola O    641.926154
Escola N    644.000000
Escola M    650.000000
Escola D    652.000000
Escola A    655.000000
dtype: float64

**Qual a nota média dos alunos em Redação para cada escola?**

In [40]:
media_red_escola = df_full.groupby(['Nome_Escola']).mean()['Nota_Redacao'].sort_values(); media_red_escola

Nome_Escola
Escola L    80.744686
Escola N    80.746258
Escola D    80.934412
Escola M    80.966394
Escola H    81.033963
Escola B    81.158020
Escola A    81.182722
Escola C    83.725724
Escola O    83.810462
Escola I    83.814988
Escola E    83.816757
Escola K    83.955000
Escola G    83.975780
Escola F    83.989488
Escola J    84.044699
Name: Nota_Redacao, dtype: float64

**Qual a nota média dos alunos em Matemática para cada escola?**

In [41]:
media_mat_escola = df_full.groupby(['Nome_Escola']).mean()['Nota_Matematica'].sort_values(); media_mat_escola

Nome_Escola
Escola A    76.629414
Escola B    76.711767
Escola L    76.842711
Escola H    77.048432
Escola M    77.072464
Escola N    77.102592
Escola D    77.289752
Escola G    83.061895
Escola F    83.274201
Escola E    83.351499
Escola C    83.359455
Escola O    83.435077
Escola K    83.682222
Escola I    83.803279
Escola J    83.839917
Name: Nota_Matematica, dtype: float64

Obs: A escola com maior orçamento não possui a maior média de nota em Redação e nem em Matemática.

**Considerando somente os alunos aprovados em Redação, qual a média de alunos aprovados por escola?**

In [42]:
# Aprovados em redação
aprovados_red = df_full[df_full['Nota_Redacao'] >= 70] ; aprovados_red.head()

,ID_Estudante,Nome_Estudante,Genero,Serie,Nome_Escola,Nota_Redacao,Nota_Matematica,ID_Escola,Tipo_Escola,Numero_Alunos,Orcamento_Anual
1,1,Paul Smith,M,9,Escola A,94,61,0,Publica,2917,1910635
2,2,John Rodriguez,M,9,Escola A,90,60,0,Publica,2917,1910635
4,4,William Ray,F,6,Escola A,97,84,0,Publica,2917,1910635
5,5,James Miranda,M,6,Escola A,94,94,0,Publica,2917,1910635
6,6,Benjamin Carter,F,8,Escola A,82,80,0,Publica,2917,1910635

In [43]:
media_aprov_red_escola = aprovados_red.groupby(['Nome_Escola']).count()['Nome_Estudante'].sort_values() ; media_aprov_red_escola

Nome_Escola
Escola I     411
Escola J     923
Escola E    1426
Escola O    1581
Escola C    1688
Escola K    1739
Escola G    1803
Escola N    2172
Escola F    2204
Escola A    2372
Escola B    2381
Escola L    3208
Escola D    3748
Escola M    3867
Escola H    4077
Name: Nome_Estudante, dtype: int64

In [44]:
media_aprov_red_escola = (media_aprov_red_escola / tot_estudantes_escolas) * 100; media_aprov_red_escola

Escola A    81.316421
Escola B    80.739234
Escola C    95.854628
Escola D    80.862999
Escola E    97.138965
Escola F    96.539641
Escola G    97.039828
Escola H    81.933280
Escola I    96.252927
Escola J    95.945946
Escola K    96.611111
Escola L    80.220055
Escola M    81.222432
Escola N    79.299014
Escola O    97.292308
dtype: float64

**Considerando somente os alunos aprovados em Matemática, qual a média de alunos aprovados por escola?**

In [45]:
# Aprovados Matemática
aprovados_mat = df_full[df_full['Nota_Matematica'] >= 70] ; aprovados_mat.head()

,ID_Estudante,Nome_Estudante,Genero,Serie,Nome_Escola,Nota_Redacao,Nota_Matematica,ID_Escola,Tipo_Escola,Numero_Alunos,Orcamento_Anual
0,0,Kevin Bradley,M,6,Escola A,66,79,0,Publica,2917,1910635
4,4,William Ray,F,6,Escola A,97,84,0,Publica,2917,1910635
5,5,James Miranda,M,6,Escola A,94,94,0,Publica,2917,1910635
6,6,Benjamin Carter,F,8,Escola A,82,80,0,Publica,2917,1910635
8,8,Ethan Roth,M,7,Escola A,95,87,0,Publica,2917,1910635

In [46]:
media_aprov_mat_escola = aprovados_mat.groupby(['Nome_Escola']).count()['Nome_Estudante'].sort_values(); media_aprov_mat_escola

Nome_Escola
Escola I     395
Escola J     910
Escola E    1371
Escola O    1515
Escola C    1653
Escola K    1680
Escola G    1749
Escola N    1871
Escola A    1916
Escola B    1946
Escola F    2143
Escola L    2654
Escola D    3094
Escola M    3145
Escola H    3318
Name: Nome_Estudante, dtype: int64

In [47]:
media_aprov_mat_escola = (media_aprov_mat_escola / tot_estudantes_escolas) * 100 ; media_aprov_mat_escola

Escola A    65.683922
Escola B    65.988471
Escola C    93.867121
Escola D    66.752967
Escola E    93.392371
Escola F    93.867718
Escola G    94.133477
Escola H    66.680064
Escola I    92.505855
Escola J    94.594595
Escola K    93.333333
Escola L    66.366592
Escola M    66.057551
Escola N    68.309602
Escola O    93.230769
dtype: float64

**Considerando alunos aprovados em Matemática e Redação, qual foi a média de alunos aprovados por escola?**

In [48]:
aprov_mat_red = df_full[(df_full['Nota_Matematica'] >= 70) & (df_full['Nota_Redacao'] >= 70)]; aprov_mat_red.head()

,ID_Estudante,Nome_Estudante,Genero,Serie,Nome_Escola,Nota_Redacao,Nota_Matematica,ID_Escola,Tipo_Escola,Numero_Alunos,Orcamento_Anual
4,4,William Ray,F,6,Escola A,97,84,0,Publica,2917,1910635
5,5,James Miranda,M,6,Escola A,94,94,0,Publica,2917,1910635
6,6,Benjamin Carter,F,8,Escola A,82,80,0,Publica,2917,1910635
8,8,Ethan Roth,M,7,Escola A,95,87,0,Publica,2917,1910635
9,9,Jacob Greene,M,7,Escola A,96,84,0,Publica,2917,1910635

In [49]:
media_aprov_mat_red = aprov_mat_red.groupby(['Nome_Escola']).count()['Nome_Estudante'].sort_values(); media_aprov_mat_red

Nome_Escola
Escola I     381
Escola J     871
Escola E    1330
Escola O    1477
Escola N    1487
Escola A    1561
Escola B    1569
Escola C    1583
Escola K    1626
Escola G    1697
Escola F    2068
Escola L    2119
Escola D    2481
Escola M    2549
Escola H    2719
Name: Nome_Estudante, dtype: int64

In [50]:
media_aprov_mat_red = (media_aprov_mat_red / tot_estudantes_escolas) * 100; media_aprov_mat_red

Escola A    53.513884
Escola B    53.204476
Escola C    89.892107
Escola D    53.527508
Escola E    90.599455
Escola F    90.582567
Escola G    91.334769
Escola H    54.642283
Escola I    89.227166
Escola J    90.540541
Escola K    90.333333
Escola L    52.988247
Escola M    53.539172
Escola N    54.289887
Escola O    90.892308
dtype: float64

**Vamos construir um dataframe de resumo com as métricas anteriores.**

In [51]:
df_resumo_performance_escolar = pd.DataFrame({"Tipo Escola": tipos_escolas,
                                              "Total Estudantes": tot_estudantes_escolas,
                                              "Total Orçamento": orcamento_escolas,
                                              "Orçamento Por Estudante": tot_orc_per_capita,
                                              "Nota Média Aprovação Redação": media_red_escola,
                                              "Nota Média Aprovação Matemática": media_mat_escola,
                                              "% Aprovados Redação": media_aprov_red_escola,
                                              "% Aprovados Matemática": media_aprov_mat_escola,
                                              "% Geral Aprovados": media_aprov_mat_red})

In [52]:
df_resumo_performance_escolar

,Tipo Escola,Total Estudantes,Total Orçamento,Orçamento Por Estudante,Nota Média Aprovação Redação,Nota Média Aprovação Matemática,% Aprovados Redação,% Aprovados Matemática,% Geral Aprovados
Escola A,Publica,2917,1910635.0,655.000000,81.182722,76.629414,81.316421,65.683922,53.513884
Escola B,Publica,2949,1884411.0,639.000000,81.158020,76.711767,80.739234,65.988471,53.204476
Escola C,Particular,1761,1056600.0,600.000000,83.725724,83.359455,95.854628,93.867121,89.892107
Escola D,Publica,4635,3022020.0,652.000000,80.934412,77.289752,80.862999,66.752967,53.527508
Escola E,Particular,1468,917500.0,625.000000,83.816757,83.351499,97.138965,93.392371,90.599455
Escola F,Particular,2283,1319574.0,578.000000,83.989488,83.274201,96.539641,93.867718,90.582567
Escola G,Particular,1858,1081356.0,582.000000,83.975780,83.061895,97.039828,94.133477,91.334769
Escola H,Publica,4976,3124928.0,628.000000,81.033963,77.048432,81.933280,66.680064,54.642283
Escola I,Particular,427,248087.0,581.000000,83.814988,83.803279,96.252927,92.505855,89.227166
Escola J,Particular,962,585858.0,609.000000,84.044699,83.839917,95.945946,94.594595,90.540541
Escola K,Particular,1800,1049400.0,583.000000,83.955000,83.682222,96.611111,93.333333,90.333333
Escola L,Publica,3999,2547363.0,637.000000,80.744686,76.842711,80.220055,66.366592,52.988247
Escola M,Publica,4761,3094650.0,650.000000,80.966394,77.072464,81.222432,66.057551,53.539172
Escola N,Publica,2739,1763916.0,644.000000,80.746258,77.102592,79.299014,68.309602,54.289887
Escola O,Particular,1625,1043130.0,641.926154,83.810462,83.435077,97.292308,93.230769,90.892308

In [53]:
# Formatação de algumas colunas
df_resumo_performance_escolar["Total Orçamento"] = df_resumo_performance_escolar["Total Orçamento"].map("${:,.2f}".format)
df_resumo_performance_escolar["Orçamento Por Estudante"] = df_resumo_performance_escolar["Orçamento Por Estudante"].map("${:,.2f}".format)

In [54]:
df_resumo_performance_escolar

,Tipo Escola,Total Estudantes,Total Orçamento,Orçamento Por Estudante,Nota Média Aprovação Redação,Nota Média Aprovação Matemática,% Aprovados Redação,% Aprovados Matemática,% Geral Aprovados
Escola A,Publica,2917,"$1,910,635.00",$655.00,81.182722,76.629414,81.316421,65.683922,53.513884
Escola B,Publica,2949,"$1,884,411.00",$639.00,81.158020,76.711767,80.739234,65.988471,53.204476
Escola C,Particular,1761,"$1,056,600.00",$600.00,83.725724,83.359455,95.854628,93.867121,89.892107
Escola D,Publica,4635,"$3,022,020.00",$652.00,80.934412,77.289752,80.862999,66.752967,53.527508
Escola E,Particular,1468,"$917,500.00",$625.00,83.816757,83.351499,97.138965,93.392371,90.599455
Escola F,Particular,2283,"$1,319,574.00",$578.00,83.989488,83.274201,96.539641,93.867718,90.582567
Escola G,Particular,1858,"$1,081,356.00",$582.00,83.975780,83.061895,97.039828,94.133477,91.334769
Escola H,Publica,4976,"$3,124,928.00",$628.00,81.033963,77.048432,81.933280,66.680064,54.642283
Escola I,Particular,427,"$248,087.00",$581.00,83.814988,83.803279,96.252927,92.505855,89.227166
Escola J,Particular,962,"$585,858.00",$609.00,84.044699,83.839917,95.945946,94.594595,90.540541
Escola K,Particular,1800,"$1,049,400.00",$583.00,83.955000,83.682222,96.611111,93.333333,90.333333
Escola L,Publica,3999,"$2,547,363.00",$637.00,80.744686,76.842711,80.220055,66.366592,52.988247
Escola M,Publica,4761,"$3,094,650.00",$650.00,80.966394,77.072464,81.222432,66.057551,53.539172
Escola N,Publica,2739,"$1,763,916.00",$644.00,80.746258,77.102592,79.299014,68.309602,54.289887
Escola O,Particular,1625,"$1,043,130.00",$641.93,83.810462,83.435077,97.292308,93.230769,90.892308

In [55]:
df_resumo_performance_escolar.describe()

,Total Estudantes,Nota Média Aprovação Redação,Nota Média Aprovação Matemática,% Aprovados Redação,% Aprovados Matemática,% Geral Aprovados
count,15.000000,15.000000,15.000000,15.000000,15.000000,15.000000
mean,2610.666667,82.526623,80.433645,89.217919,80.984294,73.273847
std,1421.408339,1.516973,3.375608,8.179495,13.996232,18.988451
min,427.000000,80.744686,76.629414,79.299014,65.683922,52.988247
25%,1693.000000,81.000178,77.060448,81.042716,66.523328,53.533340
50%,2283.000000,83.725724,83.061895,95.854628,92.505855,89.227166
75%,3474.000000,83.885879,83.397266,96.575376,93.629746,90.561554
max,4976.000000,84.044699,83.839917,97.292308,94.594595,91.334769

**Considerando a taxa geral de aprovados, quais as 5 escolas com melhor performance?**

In [56]:
top_cinco = df_resumo_performance_escolar.sort_values('% Geral Aprovados', ascending = False).head(5) ; top_cinco

,Tipo Escola,Total Estudantes,Total Orçamento,Orçamento Por Estudante,Nota Média Aprovação Redação,Nota Média Aprovação Matemática,% Aprovados Redação,% Aprovados Matemática,% Geral Aprovados
Escola G,Particular,1858,"$1,081,356.00",$582.00,83.975780,83.061895,97.039828,94.133477,91.334769
Escola O,Particular,1625,"$1,043,130.00",$641.93,83.810462,83.435077,97.292308,93.230769,90.892308
Escola E,Particular,1468,"$917,500.00",$625.00,83.816757,83.351499,97.138965,93.392371,90.599455
Escola F,Particular,2283,"$1,319,574.00",$578.00,83.989488,83.274201,96.539641,93.867718,90.582567
Escola J,Particular,962,"$585,858.00",$609.00,84.044699,83.839917,95.945946,94.594595,90.540541

**Considerando a taxa geral de aprovados, quais as 5 escolas com pior performance?**

In [57]:
pior_cinco = df_resumo_performance_escolar.sort_values('% Geral Aprovados', ascending = True).head(5) ; pior_cinco

,Tipo Escola,Total Estudantes,Total Orçamento,Orçamento Por Estudante,Nota Média Aprovação Redação,Nota Média Aprovação Matemática,% Aprovados Redação,% Aprovados Matemática,% Geral Aprovados
Escola L,Publica,3999,"$2,547,363.00",$637.00,80.744686,76.842711,80.220055,66.366592,52.988247
Escola B,Publica,2949,"$1,884,411.00",$639.00,81.158020,76.711767,80.739234,65.988471,53.204476
Escola A,Publica,2917,"$1,910,635.00",$655.00,81.182722,76.629414,81.316421,65.683922,53.513884
Escola D,Publica,4635,"$3,022,020.00",$652.00,80.934412,77.289752,80.862999,66.752967,53.527508
Escola M,Publica,4761,"$3,094,650.00",$650.00,80.966394,77.072464,81.222432,66.057551,53.539172

**Em cada série, qual escola teve os alunos com melhor performance em Matemática?**

In [58]:
# Filtro por série
sexta_serie = df_full[(df_full["Serie"] == 6)]
setima_serie = df_full[(df_full["Serie"] == 7)]
oitava_serie = df_full[(df_full["Serie"] == 8)]
nona_serie = df_full[(df_full["Serie"] == 9)]

In [59]:
notas_sexta_serie = sexta_serie.groupby(["Nome_Escola"]).mean()["Nota_Matematica"]
notas_setima_serie = setima_serie.groupby(["Nome_Escola"]).mean()["Nota_Matematica"]
notas_oitava_serie = oitava_serie.groupby(["Nome_Escola"]).mean()["Nota_Matematica"]
notas_nona_serie = nona_serie.groupby(["Nome_Escola"]).mean()["Nota_Matematica"]

In [60]:
notas_por_serie = pd.DataFrame({"Sexta Série": notas_sexta_serie, 
                                "Sétima Série": notas_setima_serie,
                                "Oitava Série": notas_oitava_serie, 
                                "Nona Série": notas_nona_serie})

In [61]:
notas_por_serie.sort_values(by = "Nome_Escola")

             Sexta Série  Sétima Série  Oitava Série  Nona Série
Nome_Escola
Escola A       77.027251     75.908735     76.446602   77.225641
Escola B       76.403037     76.539974     76.884344   77.151369
Escola C       83.420755     82.917411     83.383495   83.778976
Escola D       77.438495     77.337408     77.136029   77.186567
Escola E       82.044010     84.229064     83.842105   83.356164
Escola F       83.085578     83.724422     83.195326   83.035794
Escola G       83.094697     83.154506     82.765560   83.277487
Escola H       77.083676     76.996772     77.515588   76.492218
Escola I       83.787402     83.429825     85.000000   82.855422
Escola J       83.625455     83.372000     84.328125   84.121547
Escola K       83.264706     84.010288     83.836782   83.644986
Escola L       76.859966     76.612500     76.395626   77.690748
Escola M       77.187857     76.691117     77.491653   76.863248
Escola N       77.361345     77.672316     76.918058   76.179963
Escola O       83.605664     83.100478     83.533981   83.497024

In [62]:
notas_por_serie["Sexta Série"].idxmax()

'Escola I'

In [63]:
notas_por_serie["Sétima Série"].idxmax()

'Escola E'

In [64]:
notas_por_serie["Oitava Série"].idxmax()

'Escola I'

In [65]:
notas_por_serie["Nona Série"].idxmax()

'Escola J'

**Considerando as faixas de gastos por estudante como sendo: [0, 585, 630, 645, 680], qual faixa resulta em estudantes com melhor performance?**

In [66]:
df_resumo_performance_escolar.head()

,Tipo Escola,Total Estudantes,Total Orçamento,Orçamento Por Estudante,Nota Média Aprovação Redação,Nota Média Aprovação Matemática,% Aprovados Redação,% Aprovados Matemática,% Geral Aprovados
Escola A,Publica,2917,"$1,910,635.00",$655.00,81.182722,76.629414,81.316421,65.683922,53.513884
Escola B,Publica,2949,"$1,884,411.00",$639.00,81.158020,76.711767,80.739234,65.988471,53.204476
Escola C,Particular,1761,"$1,056,600.00",$600.00,83.725724,83.359455,95.854628,93.867121,89.892107
Escola D,Publica,4635,"$3,022,020.00",$652.00,80.934412,77.289752,80.862999,66.752967,53.527508
Escola E,Particular,1468,"$917,500.00",$625.00,83.816757,83.351499,97.138965,93.392371,90.599455

In [67]:
df_resumo_performance_escolar.columns

Index(['Tipo Escola', 'Total Estudantes', 'Total Orçamento',
       'Orçamento Por Estudante', 'Nota Média Aprovação Redação',
       'Nota Média Aprovação Matemática', '% Aprovados Redação',
       '% Aprovados Matemática', '% Geral Aprovados'],
      dtype='object')

In [68]:
# Cria a variável para faixa de gasto
faixa_bins = [0,585,630,645, 680]

In [69]:
# Cria a variável para nome da faixa_gasto
labels_faixa = ['<$585', '$585-630', '$630-645', '$645-680']

In [70]:
df_resumo_performance_escolar['Faixa Gasto Por Estudante'] = pd.cut(tot_orc_per_capita,
                                                                    faixa_bins,
                                                                    labels = labels_faixa,
                                                                    right = False)

In [71]:
df_resumo_performance_escolar.head()

,Tipo Escola,Total Estudantes,Total Orçamento,Orçamento Por Estudante,Nota Média Aprovação Redação,Nota Média Aprovação Matemática,% Aprovados Redação,% Aprovados Matemática,% Geral Aprovados,Faixa Gasto Por Estudante
Escola A,Publica,2917,"$1,910,635.00",$655.00,81.182722,76.629414,81.316421,65.683922,53.513884,$645-680
Escola B,Publica,2949,"$1,884,411.00",$639.00,81.158020,76.711767,80.739234,65.988471,53.204476,$630-645
Escola C,Particular,1761,"$1,056,600.00",$600.00,83.725724,83.359455,95.854628,93.867121,89.892107,$585-630
Escola D,Publica,4635,"$3,022,020.00",$652.00,80.934412,77.289752,80.862999,66.752967,53.527508,$645-680
Escola E,Particular,1468,"$917,500.00",$625.00,83.816757,83.351499,97.138965,93.392371,90.599455,$585-630

In [72]:
# Filtro para criação de um dataset
df_bins_1 = df_resumo_performance_escolar.groupby(['Faixa Gasto Por Estudante']).mean()['Nota Média Aprovação Redação']
df_bins_2 = df_resumo_performance_escolar.groupby(['Faixa Gasto Por Estudante']).mean()['Nota Média Aprovação Matemática']
df_bins_3 = df_resumo_performance_escolar.groupby(['Faixa Gasto Por Estudante']).mean()['% Aprovados Redação']
df_bins_4 = df_resumo_performance_escolar.groupby(['Faixa Gasto Por Estudante']).mean()['% Aprovados Matemática']
df_bins_5 = df_resumo_performance_escolar.groupby(['Faixa Gasto Por Estudante']).mean()['% Geral Aprovados']

In [73]:
# Criação do Dataframe
df_performance_gastos = pd.DataFrame({'Média Redação': df_bins_1.round(2),
                                      'Média Matemática' : df_bins_2.round(2),
                                      '% Aprovados Redação' : df_bins_3.round(2),
                                      '% Aprovados Matemática' : df_bins_4.round(2),
                                      '% Geral Aprovados': df_bins_5.round(2)})

In [74]:
df_performance_gastos

,Média Redação,Média Matemática,% Aprovados Redação,% Aprovados Matemática,% Geral Aprovados
Faixa Gasto Por Estudante,,,,,
<$585,83.93,83.46,96.61,93.46,90.37
$585-630,83.16,81.90,92.72,87.13,81.42
$630-645,81.61,78.52,84.39,73.47,62.84
$645-680,81.03,77.00,81.13,66.16,53.53

**Considerando as faixas de tamanho (número de alunos) das escolas como sendo: [0, 1000, 2000, 5000], qual faixa resulta em estudantes com melhor performance?**

In [75]:
# Criação da variável de faixa
faixa_bins_est = [0,1000, 2000, 5000]

In [76]:
# Criação da variável com nomes das faixas
labels_est = ["Pequeno Porte (<1000)", "Médio Porte (1000-2000)", "Grande Porte (2000-5000)"]

In [77]:
df_resumo_performance_escolar.columns

Index(['Tipo Escola', 'Total Estudantes', 'Total Orçamento',
       'Orçamento Por Estudante', 'Nota Média Aprovação Redação',
       'Nota Média Aprovação Matemática', '% Aprovados Redação',
       '% Aprovados Matemática', '% Geral Aprovados',
       'Faixa Gasto Por Estudante'],
      dtype='object')

In [78]:
df_resumo_performance_escolar['Porte Escola'] = pd.cut(tot_estudantes_escolas,
                                                       faixa_bins_est,
                                                       labels = labels_est,
                                                       right = False)

In [79]:
df_resumo_performance_escolar.head(3)

,Tipo Escola,Total Estudantes,Total Orçamento,Orçamento Por Estudante,Nota Média Aprovação Redação,Nota Média Aprovação Matemática,% Aprovados Redação,% Aprovados Matemática,% Geral Aprovados,Faixa Gasto Por Estudante,Porte Escola
Escola A,Publica,2917,"$1,910,635.00",$655.00,81.182722,76.629414,81.316421,65.683922,53.513884,$645-680,Grande Porte (2000-5000)
Escola B,Publica,2949,"$1,884,411.00",$639.00,81.158020,76.711767,80.739234,65.988471,53.204476,$630-645,Grande Porte (2000-5000)
Escola C,Particular,1761,"$1,056,600.00",$600.00,83.725724,83.359455,95.854628,93.867121,89.892107,$585-630,Médio Porte (1000-2000)

In [80]:
# Filtro para criação de um dataset
df_est_1 = df_resumo_performance_escolar.groupby(['Porte Escola']).mean()['Nota Média Aprovação Redação']
df_est_2 = df_resumo_performance_escolar.groupby(['Porte Escola']).mean()['Nota Média Aprovação Matemática']
df_est_3 = df_resumo_performance_escolar.groupby(['Porte Escola']).mean()['% Aprovados Redação']
df_est_4 = df_resumo_performance_escolar.groupby(['Porte Escola']).mean()['% Aprovados Matemática']
df_est_5 = df_resumo_performance_escolar.groupby(['Porte Escola']).mean()['% Geral Aprovados']

In [81]:
# Criação do dataset
df_performance_porte = pd.DataFrame({'Média Redação': df_est_1.round(2),
                                      'Média Matemática' : df_est_2.round(2),
                                      '% Aprovados Redação' : df_est_3.round(2),
                                      '% Aprovados Matemática' : df_est_4.round(2),
                                      '% Geral Aprovados': df_est_5.round(2)})

In [82]:
df_performance_porte

,Média Redação,Média Matemática,% Aprovados Redação,% Aprovados Matemática,% Geral Aprovados
Porte Escola,,,,,
Pequeno Porte (<1000),83.93,83.82,96.10,93.55,89.88
Médio Porte (1000-2000),83.86,83.38,96.79,93.59,90.61
Grande Porte (2000-5000),81.34,77.75,82.77,69.96,58.29

**Qual o impacto do tipo de escola na performance dos alunos?**

In [83]:
df_resumo_performance_escolar.columns

Index(['Tipo Escola', 'Total Estudantes', 'Total Orçamento',
       'Orçamento Por Estudante', 'Nota Média Aprovação Redação',
       'Nota Média Aprovação Matemática', '% Aprovados Redação',
       '% Aprovados Matemática', '% Geral Aprovados',
       'Faixa Gasto Por Estudante', 'Porte Escola'],
      dtype='object')

In [84]:
# Filtro para criação de um dataset
df_tipo_1 = df_resumo_performance_escolar.groupby(['Tipo Escola']).mean()['Nota Média Aprovação Redação']
df_tipo_2 = df_resumo_performance_escolar.groupby(['Tipo Escola']).mean()['Nota Média Aprovação Matemática']
df_tipo_3 = df_resumo_performance_escolar.groupby(['Tipo Escola']).mean()['% Aprovados Redação']
df_tipo_4 = df_resumo_performance_escolar.groupby(['Tipo Escola']).mean()['% Aprovados Matemática']
df_tipo_5 = df_resumo_performance_escolar.groupby(['Tipo Escola']).mean()['% Geral Aprovados']

In [85]:
# Criação do dataset
df_performance_tipo = pd.DataFrame({'Média Redação': df_tipo_1.round(2),
                                      'Média Matemática' : df_tipo_2.round(2),
                                      '% Aprovados Redação' : df_tipo_3.round(2),
                                      '% Aprovados Matemática' : df_tipo_4.round(2),
                                      '% Geral Aprovados': df_tipo_5.round(2)})

In [86]:
df_performance_tipo

,Média Redação,Média Matemática,% Aprovados Redação,% Aprovados Matemática,% Geral Aprovados
Tipo Escola,,,,,
Particular,83.89,83.48,96.58,93.62,90.43
Publica,80.97,76.96,80.80,66.55,53.67

In [87]:
# Salvando em formato Excel
df_resumo_performance_escolar.to_excel('dados/df_resumo_performance_escolar.xlsx')

### Fim